challenge-18/tests/performance/artillery/result_nobloq.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 10:41:54(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:41:55(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 10:41:57(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 306/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 43
  median: ...................................................................... 15
  p95: ......................................................................... 23.8
  p99: ......................................................................... 32.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 402.9
  max: ......................................................................... 936.4
  median: ...................................................................... 820.7
  p95: ......................................................................... 925.4
  p99: ......................................................................... 925.4